[
  { "text": "What's a creative hobby you enjoy or would like to try?", "isRRated": false },
  { "text": "If you could paint a picture of your current mood, what would it look like?", "isRRated": false },
  { "text": "What's a song you wish you had written?", "isRRated": false },
  { "text": "If you were to design your dream house, what's one unique feature it would have?", "isRRated": false },
  { "text": "What's a story (real or imagined) you'd love to tell?", "isRRated": false },
  { "text": "What form of art (music, painting, writing, dance, etc.) resonates with you most and why?", "isRRated": false },
  { "text": "If you could create a new holiday, what would it celebrate and how?", "isRRated": false },
  { "text": "What's the most creative solution you've ever come up with for a problem?", "isRRated": false },
  { "text": "If you could direct a movie, what genre would it be and what would be the basic plot?", "isRRated": false },
  { "text": "What's a piece of art (any form) that has deeply moved you?", "isRRated": false },
  { "text": "If you could invent a new color, what would you call it and what would it look like?", "isRRated": false },
  { "text": "What's a creative project you've started but haven't finished (and why)?", "isRRated": false },
  { "text": "How do you overcome creative blocks?", "isRRated": false },
  { "text": "If you could collaborate with any artist (living or deceased), who would it be?", "isRRated": false },
  { "text": "What's a simple, everyday object you find beautiful or inspiring?", "isRRated": false },
  { "text": "If you were to write a poem about this moment, what would be the first line?", "isRRated": false },
  { "text": "What's a DIY project you're proud of or would like to attempt?", "isRRated": false },
  { "text": "What environment or setting inspires your creativity the most?", "isRRated": false },
  { "text": "If you could design a character for a video game or book, what would they be like?", "isRRated": false },
  { "text": "What does 'creativity' mean to you?", "isRRated": false }
]