[
{ "text": "Is there a truth about my current life path that I might be resisting?", "isRRated": false },
{ "text": "When did I last experience a profound sense of authenticity and aliveness?", "isRRated": false },
{ "text": "Deep down, what am I genuinely yearning for at this moment?", "isRRated": false },
{ "text": "Which activities make me completely lose track of time?", "isRRated": false },
{ "text": "Are there core values I feel I'm currently neglecting in my daily life?", "isRRated": false },
{ "text": "If fear were not a factor, what action would I take right now?", "isRRated": false },
{ "text": "Imagine my younger, more idealistic self; what advice would they offer me today?", "isRRated": false },
{ "text": "Can I identify one small, manageable step towards clarity I can take today?", "isRRated": false },
{ "text": "Whose definition of success am I unconsciously trying to live up to?", "isRRated": false },
{ "text": "Even amidst this confusion, for what am I truly grateful?", "isRRated": false },
{ "text": "Which areas of my life feel most out of alignment with my authentic self?", "isRRated": false },
{ "text": "Are there any passions I've set aside that I could revisit for joy or inspiration?", "isRRated": false },
{ "text": "Identify environments or people that drain my energy versus those that energize me.", "isRRated": false },
{ "text": "Am I seeking external permission for something I already know I need to do?", "isRRated": false },
{ "text": "What is my intuition quietly whispering to me about my situation?", "isRRated": false },
{ "text": "If I had to describe my current state in one honest sentence, what would it be?", "isRRated": false },
{ "text": "Recall past challenges I've overcome; how can they offer strength now?", "isRRated": false },
{ "text": "Regardless of scale, what kind of impact do I truly wish to make?", "isRRated": false },
{ "text": "What am I currently tolerating that I know, deep down, I shouldn't be?", "isRRated": false },
{ "text": "Describe the feeling of 'coming home to myself'; what does that entail for me?", "isRRated": false }
]