[
  { "text": "What's one thing you're genuinely excited about for the future?", "isRRated": false },
  { "text": "Where do you see yourself in 5 years? 10 years?", "isRRated": false },
  { "text": "What's a skill you hope to learn or master in the future?", "isRRated": false },
  { "text": "What's a societal change you hope to see in your lifetime?", "isRRated": false },
  { "text": "If you could get a glimpse of one future event, what would it be?", "isRRated": false },
  { "text": "What's a personal goal you're working towards for the future?", "isRRated": false },
  { "text": "What's a piece of technology you predict will be commonplace in 20 years?", "isRRated": false },
  { "text": "What kind of ancestor do you hope to be remembered as?", "isRRated": false },
  { "text": "What's a place you dream of visiting or living in one day?", "isRRated": false },
  { "text": "What's one habit you want to cultivate for a better future self?", "isRRated": false },
  { "text": "What's a world problem you hope will be solved in the next 50 years?", "isRRated": false },
  { "text": "What advice would your future self give to your current self?", "isRRated": false },
  { "text": "What's a new experience you want to have in the coming year?", "isRRated": false },
  { "text": "How do you envision your ideal retirement?", "isRRated": false },
  { "text": "What's a trend you think will define the next decade?", "isRRated": false },
  { "text": "What's a book you plan to read or a movie you plan to watch in the near future?", "isRRated": false },
  { "text": "What's a positive impact you hope to make on your community in the future?", "isRRated": false },
  { "text": "What's one thing you're doing now to prepare for your future goals?", "isRRated": false },
  { "text": "If you could write a letter to your future self, what's one question you'd ask?", "isRRated": false },
  { "text": "What's a hope you have for the world your children or future generations will inherit?", "isRRated": false }
]