[
{ "text": "Which choice in your life brought the most unexpected joy?", "isRRated": false },
{ "text": "Is there a lesson you feel you learned a bit too late in life?", "isRRated": false },
{ "text": "Looking back, what accomplishment or aspect of your life fills you with the most pride?", "isRRated": false },
{ "text": "Share a piece of advice you wish someone had given you when you were young.", "isRRated": false },
{ "text": "Can you recall an experience that fundamentally changed your worldview?", "isRRated": false },
{ "text": "How do you define 'a life well-lived' at this stage?", "isRRated": false },
{ "text": "Describe a significant risk you took: are you glad you did, or do you wish you hadn't?", "isRRated": false },
{ "text": "What simple pleasure has consistently brought you happiness throughout your life?", "isRRated": false },
{ "text": "How did you cope during times of great loss or sorrow?", "isRRated": false },
{ "text": "Which invention or societal change during your lifetime amazed you the most?", "isRRated": false },
{ "text": "Is there a tradition from your own childhood you wish was still commonly practiced?", "isRRated": false },
{ "text": "Tell me about a dream you fulfilled and one you had to let go of.", "isRRated": false },
{ "text": "In your opinion, what is the secret to lasting love or friendship?", "isRRated": false },
{ "text": "Share a memory that always brings a smile to your face.", "isRRated": false },
{ "text": "Do you have any particular fears for future generations?", "isRRated": false },
{ "text": "What do you hope your grandchildren will remember most about you?", "isRRated": false },
{ "text": "If you could relive one day of your life, which would it be and why?", "isRRated": false },
{ "text": "Which activity made you feel most alive and authentically yourself?", "isRRated": false },
{ "text": "Are you still curious about or actively learning new things?", "isRRated": false },
{ "text": "If you had to choose a single word to describe your outlook on life today, what would it be?", "isRRated": false }
]