[
{ "text": "Is there a dream you're nurturing that you haven't shared with me yet?", "isRRated": false },
{ "text": "Which part of yourself do you feel I understand the least?", "isRRated": false },
{ "text": "Can you describe a time in your life when you felt most authentically yourself?", "isRRated": false },
{ "text": "What are you most passionate about right now, and what fuels that passion?", "isRRated": false },
{ "text": "Are you facing any challenges currently that I might not be aware of?", "isRRated": false },
{ "text": "Share a childhood memory that you feel significantly shaped who you are today.", "isRRated": false },
{ "text": "How would you define 'happiness' for yourself in this current phase of your life?", "isRRated": false },
{ "text": "Reflecting on your upbringing, is there anything you hope to do differently, or perhaps emulate?", "isRRated": false },
{ "text": "What accomplishment, big or small, are you most proud of recently?", "isRRated": false },
{ "text": "Which value do you hold most dear, and how does it guide your decisions?", "isRRated": false },
{ "text": "How do you personally define success for yourself at this point?", "isRRated": false },
{ "text": "Is there something about your adult life you wish I had a better understanding of?", "isRRated": false },
{ "text": "What kind of support from me do you find most meaningful or helpful now?", "isRRated": false },
{ "text": "In what ways do you feel genuinely loved and appreciated by me and others?", "isRRated": false },
{ "text": "Do you have any fears or anxieties about your own future?", "isRRated": false },
{ "text": "How has your perception of our relationship evolved as you've gotten older?", "isRRated": false },
{ "text": "Can you recall a piece of advice I once gave you that actually stuck or proved useful?", "isRRated": false },
{ "text": "What have you learned about the world that has genuinely surprised you?", "isRRated": false },
{ "text": "Which activities or circumstances bring you the greatest sense of peace or contentment?", "isRRated": false },
{ "text": "If you could tell me one thing completely unfiltered, what would it be?", "isRRated": false }
]