[
  { "text": "If you could live in any fictional world, which one would you choose?", "isRRated": false },
  { "text": "If you could have one 'do-over' in your life, what would it be?", "isRRated": false },
  { "text": "If you found a suitcase with a million dollars, what's the first thing you'd do?", "isRRated": false },
  { "text": "If you could time travel, would you go to the past or the future? Why?", "isRRated": false },
  { "text": "If you could master any skill instantly, what would it be?", "isRRated": false },
  { "text": "If you could switch lives with someone for a day, who would it be?", "isRRated": false },
  { "text": "If you could solve one world problem, what would it be?", "isRRated": false },
  { "text": "If you had to eat one food for the rest of your life, what would it be?", "isRRated": false },
  { "text": "If you could be an animal for a day, which one would you choose?", "isRRated": false },
  { "text": "If you could have any job in the world, regardless of pay or qualifications, what would it be?", "isRRated": false },
  { "text": "If you could invent something, what problem would it solve?", "isRRated": false },
  { "text": "If you could bring one extinct species back to life, which would it be?", "isRRated": false },
  { "text": "If you could only listen to three musical artists for the rest of your life, who would they be?", "isRRated": false },
  { "text": "If you could have a conversation with any historical figure, who would you choose?", "isRRated": false },
  { "text": "If you could change one thing about the world, what would it be?", "isRRated": false },
  { "text": "If you were stranded on a desert island, what three items would you want with you?", "isRRated": false },
  { "text": "If you could have a mythical creature as a pet, what would it be?", "isRRated": false },
  { "text": "If you could write a book, what genre would it be and what would it be about?", "isRRated": false },
  { "text": "If you could witness any event in history, past, present, or future, what would it be?", "isRRated": false },
  { "text": "If you could only keep five possessions, what would they be?", "isRRated": false }
]