[
{ "text": "If I choose this path, what am I truly afraid of losing?", "isRRated": false },
{ "text": "Which option aligns more closely with my deepest, core values?", "isRRated": false },
{ "text": "Setting fear aside completely, what would my heart guide me to do?", "isRRated": false },
{ "text": "Identify the core motivation driving this potential significant change.", "isRRated": false },
{ "text": "Consider the best and worst-case scenarios: can I genuinely handle both outcomes?", "isRRated": false },
{ "text": "Whose advice am I currently weighing most heavily, and why their opinion?", "isRRated": false },
{ "text": "What is my intuition or gut feeling trying to tell me about this decision?", "isRRated": false },
{ "text": "How will this decision potentially impact the people I care most about?", "isRRated": false },
{ "text": "Looking ahead, what long-term future does this choice enable, or possibly prevent?", "isRRated": false },
{ "text": "Am I primarily running away from something, or am I moving towards something desirable?", "isRRated": false },
{ "text": "Is there any crucial information I might be missing before I commit to a decision?", "isRRated": false },
{ "text": "How might this decision alter or affirm my sense of self or identity?", "isRRated": false },
{ "text": "What are the absolute non-negotiables for me in this situation?", "isRRated": false },
{ "text": "Fast forward 5 or 10 years: what will I regret more – making this change or not making it?", "isRRated": false },
{ "text": "Could I design a small experiment to test the waters before fully committing?", "isRRated": false },
{ "text": "Honestly assess: how prepared am I, truly, for the changes this decision will bring?", "isRRated": false },
{ "text": "Which resources (emotional, financial, practical) will I need to navigate this successfully?", "isRRated": false },
{ "text": "Does this decision feel more expansive and opening, or more restrictive and closing?", "isRRated": false },
{ "text": "Which part of me is leading this decision – my logical head, my emotional heart, or my ego?", "isRRated": false },
{ "text": "If I proceed with this choice, what will I consciously need to let go of?", "isRRated": false }
]