[
{ "text": "Did you see an essential part of me back then that I couldn't see in myself?", "isRRated": false },
{ "text": "How do you feel loving me, or being loved by me, genuinely changed you?", "isRRated": false },
{ "text": "Is there a beautiful lesson from our time together that you still carry with you?", "isRRated": false },
{ "text": "Describe a fond memory of 'us' that still brings a smile to your face.", "isRRated": false },
{ "text": "What did our relationship teach you about what you truly need or desire in a partner?", "isRRated": false },
{ "text": "Is there anything you wish you had said to me during our time together, but didn't?", "isRRated": false },
{ "text": "Which quality in me did you genuinely admire or appreciate?", "isRRated": false },
{ "text": "Looking back, what do you consider our greatest strength as a couple?", "isRRated": false },
{ "text": "Conversely, what was the biggest challenge we ultimately couldn't overcome?", "isRRated": false },
{ "text": "How do you remember the very beginning of our story, when we first connected?", "isRRated": false },
{ "text": "In what way, if any, do you feel our ending contributed to your personal growth?", "isRRated": false },
{ "text": "Is there a particular song, place, or object that still strongly reminds you of 'us'?", "isRRated": false },
{ "text": "Share one thing you now understand about me that you didn't grasp back then.", "isRRated": false },
{ "text": "From a place of sincerity, what do you genuinely wish for me in my life now?", "isRRated": false },
{ "text": "How did our connection influence the path your life took afterwards?", "isRRated": false },
{ "text": "If you could offer our younger selves one piece of advice about the relationship, what would it be?", "isRRated": false },
{ "text": "For which aspect of our shared time are you most grateful?", "isRRated": false },
{ "text": "Do you believe we were 'meant to be,' even if it wasn't for forever?", "isRRated": false },
{ "text": "In your mind, what is the most positive legacy of our time together?", "isRRated": false },
{ "text": "If we had to describe 'us' in a single word now, from a place of peace, what would that word be?", "isRRated": false }
]