[
{ "text": "Which inner resource surprised you most with its strength during that difficult time?", "isRRated": false },
{ "text": "How did that struggle reshape or redefine your sense of purpose in life?", "isRRated": false },
{ "text": "Is there a scar from that experience that still aches, and what helps to heal it?", "isRRated": false },
{ "text": "Was there a moment you felt close to giving up? What ultimately kept you going?", "isRRated": false },
{ "text": "In what ways did your relationships with others change as a result of this experience?", "isRRated": false },
{ "text": "What did you learn about human kindness, or perhaps its opposite, through this adversity?", "isRRated": false },
{ "text": "Share one thing you wish others truly understood about what you went through.", "isRRated": false },
{ "text": "How has your definition or perception of 'strength' evolved since then?", "isRRated": false },
{ "text": "Can you recall any small victories or moments of light you clung to during the struggle?", "isRRated": false },
{ "text": "Did your perspective on life's priorities undergo a dramatic shift due to this adversity?", "isRRated": false },
{ "text": "What role did hope play in your journey? How did you nurture or maintain it?", "isRRated": false },
{ "text": "Is there a piece of advice you received during that time that genuinely helped you?", "isRRated": false },
{ "text": "How do you practice self-compassion when reflecting on that challenging period?", "isRRated": false },
{ "text": "Did you find any unexpected beauty or profound lessons hidden within the darkness?", "isRRated": false },
{ "text": "In what positive ways has this adversity shaped the person you are today?", "isRRated": false },
{ "text": "What practices or boundaries do you now implement to protect your peace or well-being?", "isRRated": false },
{ "text": "If you could speak to yourself at the very beginning of that struggle, what would you say?", "isRRated": false },
{ "text": "In the context of this experience, what does 'healing' truly mean to you?", "isRRated": false },
{ "text": "Looking back, what are you most grateful for having come through that experience?", "isRRated": false },
{ "text": "How has this experience influenced your capacity for empathy towards others?", "isRRated": false }
]