[
{ "text": "When do you experience the most profound sense of 'us' as a couple?", "isRRated": false },
{ "text": "Which part of my soul do you feel you connect with most deeply?", "isRRated": false },
{ "text": "Is there a silent hope you hold for our future together that you haven't voiced?", "isRRated": false },
{ "text": "In what specific moments do you feel most loved and cherished by me?", "isRRated": false },
{ "text": "Describe a vulnerability you feel safe enough to show only to me.", "isRRated": false },
{ "text": "How do you believe we contribute to each other's growth as individuals?", "isRRated": false },
{ "text": "What does our connection provide you that you haven't found in other relationships?", "isRRated": false },
{ "text": "Do you have any fears, even small ones, concerning our relationship?", "isRRated": false },
{ "text": "When you look at me, what positive qualities or strengths do you see that I might overlook in myself?", "isRRated": false },
{ "text": "Among the dreams we share, which one means the absolute most to you?", "isRRated": false },
{ "text": "How has loving me, or being in this relationship, changed your perspective on life or love itself?", "isRRated": false },
{ "text": "Is there an unspoken need you currently have within our relationship?", "isRRated": false },
{ "text": "Beyond the physical, what does 'intimacy' truly mean to you in the context of 'us'?", "isRRated": false },
{ "text": "Can you identify one specific way I make you feel completely safe and secure?", "isRRated": false },
{ "text": "If our love story were a book, what title would you give this current chapter?", "isRRated": false },
{ "text": "Which quality inherent in our relationship are you most proud of us for cultivating?", "isRRated": false },
{ "text": "How effectively do you feel we navigate the difficult or challenging times together?", "isRRated": false },
{ "text": "Is there a small, everyday thing that consistently reminds you of your love for me?", "isRRated": false },
{ "text": "Which part of your inner world are you still hoping for me to explore and understand more deeply?", "isRRated": false },
{ "text": "If you were to describe the essence of our bond in just three words, what would they be?", "isRRated": false }
]