[
{ "text": "Which core belief about myself did this setback directly challenge?", "isRRated": false },
{ "text": "Are there any emotions or truths related to this situation that I'm currently avoiding?", "isRRated": false },
{ "text": "How can this experience potentially make me a more compassionate individual?", "isRRated": false },
{ "text": "What was the single hardest truth to accept about this situation or its outcome?", "isRRated": false },
{ "text": "Looking back, were there any warning signs or red flags that I might have ignored?", "isRRated": false },
{ "text": "Beyond the outcome itself, what did I learn about my process or approach?", "isRRated": false },
{ "text": "Did any internal or external pressures significantly contribute to this outcome?", "isRRated": false },
{ "text": "With whom can I safely and openly be vulnerable about this experience?", "isRRated": false },
{ "text": "Identify one small aspect of this situation that I can still control or positively influence now.", "isRRated": false },
{ "text": "What am I truly afraid this failure says about me as a person?", "isRRated": false },
{ "text": "How can I reframe this experience not just as a loss, but as a valuable lesson learned?", "isRRated": false },
{ "text": "Does this failure reveal any recurring patterns or tendencies in my life?", "isRRated": false },
{ "text": "What specific act of kindness or self-compassion can I offer myself in this moment?", "isRRated": false },
{ "text": "Describe what success would have looked like; how attached was I to that specific vision?", "isRRated": false },
{ "text": "Is it possible that this failure is inadvertently creating a hidden opportunity for growth or change?", "isRRated": false },
{ "text": "How has this experience impacted my trust in myself or in others?", "isRRated": false },
{ "text": "As a result of this, what am I no longer willing to tolerate in my life or work?", "isRRated": false },
{ "text": "If I had to choose one word to describe the dominant emotion I feel about this, what would it be?", "isRRated": false },
{ "text": "How can I consciously use the lessons from this experience to fuel future growth?", "isRRated": false },
{ "text": "If I were advising a close friend in this exact same situation, what counsel would I offer?", "isRRated": false }
]