[
  { "text": "What quality do you value most in a friend?", "isRRated": false },
  { "text": "What's a common misconception people have about relationships (any kind)?", "isRRated": false },
  { "text": "How do you show appreciation for the important people in your life?", "isRRated": false },
  { "text": "What's a deal-breaker for you in a friendship or partnership?", "isRRated": false },
  { "text": "What's the best way to resolve conflict in a relationship?", "isRRated": false },
  { "text": "What does 'unconditional love' mean to you, and do you think it's possible?", "isRRated": false },
  { "text": "What's a lesson about relationships you've learned from a movie or book?", "isRRated": false },
  { "text": "How important is communication in maintaining healthy relationships?", "isRRated": false },
  { "text": "What's a small gesture that means a lot in a relationship?", "isRRated": false },
  { "text": "How do you maintain your individuality while being in close relationships?", "isRRated": false },
  { "text": "What's a sign of a truly strong and healthy relationship?", "isRRated": false },
  { "text": "What role does trust play in your relationships?", "isRRated": false },
  { "text": "How has a past relationship (friendship or romantic) shaped who you are today?", "isRRated": false },
  { "text": "What's your love language (for any type of relationship)?", "isRRated": false },
  { "text": "What's something you appreciate about your family relationships?", "isRRated": false },
  { "text": "What's a boundary you've set in a relationship that was important for you?", "isRRated": false },
  { "text": "How do you support a friend or loved one going through a tough time?", "isRRated": false },
  { "text": "What's a common piece of relationship advice you disagree with?", "isRRated": false },
  { "text": "What's a shared experience that strengthened a bond with someone?", "isRRated": false },
  { "text": "What does 'chosen family' mean to you?", "isRRated": false }
]