[
{ "text": "Is there a specific family memory that impacts you more deeply than I might realize?", "isRRated": false },
{ "text": "How do you believe our unique upbringing specifically shaped the person you are today?", "isRRated": false },
{ "text": "Do you still carry any past hurts or unresolved issues between us from our younger years?", "isRRated": false },
{ "text": "Describe a childhood moment you genuinely wish we could relive together.", "isRRated": false },
{ "text": "What's one thing you feel our parents never truly understood about you? And about me?", "isRRated": false },
{ "text": "How did you perceive my role within the family dynamic when we were growing up?", "isRRated": false },
{ "text": "Can you share a secret you either kept for me, or from me, that you feel comfortable revealing now?", "isRRated": false },
{ "text": "Which family tradition do you cherish the most, or perhaps miss the most?", "isRRated": false },
{ "text": "In what significant way do you think we are most alike? And most different?", "isRRated": false },
{ "text": "Identify a key lesson from our childhood that you still apply to your life today.", "isRRated": false },
{ "text": "Looking back, is there anything you wish you'd done differently concerning our relationship back then?", "isRRated": false },
{ "text": "Recall a moment you were truly proud of me. Was there ever a time I embarrassed you?", "isRRated": false },
{ "text": "How do you think our family dynamic influenced your views on relationships in general?", "isRRated": false },
{ "text": "Is there a particular object from our childhood home that holds strong, vivid memories for you?", "isRRated": false },
{ "text": "What unspoken rule within our family do you believe affected us the most significantly?", "isRRated": false },
{ "text": "Do you think I have any misconceptions about our shared past or specific events?", "isRRated": false },
{ "text": "What do you admire about the way I navigated our upbringing or family life?", "isRRated": false },
{ "text": "As a sibling, what did you need from me back then that you perhaps didn't receive, or received in abundance?", "isRRated": false },
{ "text": "If you could go back and tell our younger selves one important thing, what would it be?", "isRRated": false },
{ "text": "How has our shared history bonded us in a unique way that perhaps no one else can fully understand?", "isRRated": false }
]