[
  { "text": "What's your dream job, and what steps are you taking (or could you take) towards it?", "isRRated": false },
  { "text": "What's a skill you're currently trying to develop or improve?", "isRRated": false },
  { "text": "What does a perfect workday look like for you?", "isRRated": false },
  { "text": "What's the most rewarding part of your current work or studies?", "isRRated": false },
  { "text": "What's a major career goal you have for the next 5 years?", "isRRated": false },
  { "text": "Who is a mentor or role model who has inspired your ambitions?", "isRRated": false },
  { "text": "What's a challenge in your field that you find interesting?", "isRRated": false },
  { "text": "If you weren't in your current field, what other career path might you have chosen?", "isRRated": false },
  { "text": "What's a piece of career advice that has resonated with you?", "isRRated": false },
  { "text": "How do you stay motivated when working on long-term projects?", "isRRated": false },
  { "text": "What's more important to you in a job: passion or stability?", "isRRated": false },
  { "text": "What's a work-related accomplishment you're particularly proud of?", "isRRated": false },
  { "text": "What's one thing you wish you knew when you started your career or studies?", "isRRated": false },
  { "text": "How do you define work-life balance, and how do you try to achieve it?", "isRRated": false },
  { "text": "What's a new technology or trend in your industry that excites you?", "isRRated": false },
  { "text": "What's a 'soft skill' (e.g., communication, teamwork) you think is crucial for success?", "isRRated": false },
  { "text": "If you could start your own business, what would it be?", "isRRated": false },
  { "text": "What's a common misconception about your job or field of study?", "isRRated": false },
  { "text": "What's a personal project you're passionate about outside of work/studies?", "isRRated": false },
  { "text": "What legacy do you hope to leave through your work or contributions?", "isRRated": false }
]